content/org/meeting-notes/2012-02-14.org
#+SETUPFILE: ../../org-templates/meeting-notes.org
#+INCLUDE:   "../../org-templates/analytics.org"

Meeting Notes 2012-02-14

* Meeting Notes 2012-02-14
  - According to github, emacsclub is 95.6% JavaScript and 4.4% Emacs
    Lisp. Bootstrap, y u no in elisp?
  - According to the SEAS calendars, "Pulak Mittal Vim Club" has a meeting
    scheduled simultaneously with us. However, they didn't send out
    any advertisement.
    - *Alexey* : They were going to but they forgot to hit i first.
  - *Mish* : I'm going to do everything in emacs.
  - *Mish* : Emacs assumes you are smart. 
  - *Mish* : You can type M-x followed by any elisp function. Let's try
    zone, which is Zach's favorite. 
    - *Mish* : I don't even know what it's doing.
    - It's doing the martini swan dive.
  - Emacs comes with pdf reference cards.
    - *Zach* : Print it and keep it next to you.
  - Mish turns to the audience, and then turns back to his
    laptop. Suddenly, the projector screen withdraws and the lights dim.
    - *Andrew* : It's the vim club!
  - *Andrew* : Editing is the heart of what emacs is used for. What we do all
    day is programming, which is editing text.
    - Emacs is designed for coding.
    - *Andrew* : If you're writing an English paper, killing a line makes no
      sense.
    - [[http://vanemden.wordpress.com/2009/01/01/ventilated-prose/][Unless you're Buckminster Fuller.]]
  - *Andrew* : This is my favorite command. C-k kills a line.
  - *Mish* : You can open one of my files!
    - Andrew opens OCaml Practice, and instead gets a letter from Mish to
      whom it may concern.
  - No one uses M-k.
    - *Andrew* : That makes sense if you're writing papers!
      - No one writes papers.
  - *Zach* : This is probably Mish's coq homework.
  - Mish discusses undoing the undoing of the undo.
    - *Mish* : It'll undo your undos if you go back to when you were undoing
      things.
    - *Andrew* : You need to figure out what it's doing when you're undoing.
  - Andrew starts typing. Hello people of the world!
  - *Andrew* : It opens a buffer with all of the buffers.
  - Nick and Rafe arrive an hour late. Welcome!
  - *Andrew* : This is a frame.
    - Andrew drags the window around.
  - Rafe is a expert on emacs' LaTeX mode.
    - (Maybe Rafe writes papers?)
    - *Mish* : You should give a talk on it.
    - *Rafe* : I followed a tutorial online.
  - *Andrew* : Emacs is never wrong with indentation. If it indents
    improperly, you messed up somewhere.
  - Mish attempts to produce a regex to find emacs key shortcuts.
    - *Mish* : This is getting out of control.
  - Rafe points out that people not in SEAS might feel excluded by our
    mailing list signup form.
  - Github wished Rafe an octotastic day!
  - We browse ~/usr/share/emacs/22.1/etc/JOKES~
