content/html/meeting-notes/2012-02-14.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Meeting Notes 2012-02-14</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Meeting Notes 2012-02-14"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-25 22:11:26 EDT"/>
<meta name="author" content="Matthew Croop"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Meeting Notes 2012-02-14</h1>


<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-30426956-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>



<ul>
<li>According to github, emacsclub is 95.6% JavaScript and 4.4% Emacs
    Lisp. Bootstrap, y u no in elisp?
</li>
<li>According to the SEAS calendars, "Pulak Mittal Vim Club" has a meeting
    scheduled simultaneously with us. However, they didn't send out
    any advertisement.
<ul>
<li><b>Alexey</b> : They were going to but they forgot to hit i first.
</li>
</ul>

</li>
<li><b>Mish</b> : I'm going to do everything in emacs.
</li>
<li><b>Mish</b> : Emacs assumes you are smart. 
</li>
<li><b>Mish</b> : You can type M-x followed by any elisp function. Let's try
    zone, which is Zach's favorite. 
<ul>
<li><b>Mish</b> : I don't even know what it's doing.
</li>
<li>It's doing the martini swan dive.
</li>
</ul>

</li>
<li>Emacs comes with pdf reference cards.
<ul>
<li><b>Zach</b> : Print it and keep it next to you.
</li>
</ul>

</li>
<li>Mish turns to the audience, and then turns back to his
    laptop. Suddenly, the projector screen withdraws and the lights dim.
<ul>
<li><b>Andrew</b> : It's the vim club!
</li>
</ul>

</li>
<li><b>Andrew</b> : Editing is the heart of what emacs is used for. What we do all
    day is programming, which is editing text.
<ul>
<li>Emacs is designed for coding.
</li>
<li><b>Andrew</b> : If you're writing an English paper, killing a line makes no
      sense.
</li>
<li><a href="http://vanemden.wordpress.com/2009/01/01/ventilated-prose/">Unless you're Buckminster Fuller.</a>
</li>
</ul>

</li>
<li><b>Andrew</b> : This is my favorite command. C-k kills a line.
</li>
<li><b>Mish</b> : You can open one of my files!
<ul>
<li>Andrew opens OCaml Practice, and instead gets a letter from Mish to
      whom it may concern.
</li>
</ul>

</li>
<li>No one uses M-k.
<ul>
<li><b>Andrew</b> : That makes sense if you're writing papers!
<ul>
<li>No one writes papers.
</li>
</ul>

</li>
</ul>

</li>
<li><b>Zach</b> : This is probably Mish's coq homework.
</li>
<li>Mish discusses undoing the undoing of the undo.
<ul>
<li><b>Mish</b> : It'll undo your undos if you go back to when you were undoing
      things.
</li>
<li><b>Andrew</b> : You need to figure out what it's doing when you're undoing.
</li>
</ul>

</li>
<li>Andrew starts typing. Hello people of the world!
</li>
<li><b>Andrew</b> : It opens a buffer with all of the buffers.
</li>
<li>Nick and Rafe arrive an hour late. Welcome!
</li>
<li><b>Andrew</b> : This is a frame.
<ul>
<li>Andrew drags the window around.
</li>
</ul>

</li>
<li>Rafe is a expert on emacs' LaTeX mode.
<ul>
<li>(Maybe Rafe writes papers?)
</li>
<li><b>Mish</b> : You should give a talk on it.
</li>
<li><b>Rafe</b> : I followed a tutorial online.
</li>
</ul>

</li>
<li><b>Andrew</b> : Emacs is never wrong with indentation. If it indents
    improperly, you messed up somewhere.
</li>
<li>Mish attempts to produce a regex to find emacs key shortcuts.
<ul>
<li><b>Mish</b> : This is getting out of control.
</li>
</ul>

</li>
<li>Rafe points out that people not in SEAS might feel excluded by our
    mailing list signup form.
</li>
<li>Github wished Rafe an octotastic day!
</li>
<li>We browse <code>/usr/share/emacs/22.1/etc/JOKES</code>
</li>
</ul>

</div>

<div id="postamble">
<p class="date">Date: 2012-04-25 22:11:26 EDT</p>
<p class="author">Author: Matthew Croop</p>
<p class="creator">Org version 7.8.09 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
